In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [5]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [6]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [7]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244914 entries, 0 to 244913
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   244914 non-null  object
 1   year    244914 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.7+ MB

In [8]:
titles.describe()

                year
count  244914.000000
mean     1986.616012
std        29.459912
min      1894.000000
25%      1967.000000
50%      1997.000000
75%      2012.000000
max      2115.000000

In [9]:
len(titles)

244914

# 244914 movies are listed in the titles dataframe

### What are the earliest two films listed in the titles dataframe?

In [10]:
titles.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [11]:
len(titles[titles.title == 'Hamlet'])

20

### How many movies are titled "North by Northwest"?

In [12]:
len(titles[titles.title == 'North by Northwest'])

1

### When was the first movie titled "Hamlet" made?

In [13]:
titles[titles.title=='Hamlet'].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [14]:
titles[titles.title=='Treasure Island']

                  title  year
27076   Treasure Island  1999
37238   Treasure Island  1973
55686   Treasure Island  1918
65051   Treasure Island  1972
77354   Treasure Island  1950
141822  Treasure Island  1934
173051  Treasure Island  1985
196514  Treasure Island  1920

### How many movies were made in the year 1950?

In [15]:
len(titles[titles.year == 1950])

1113

### How many movies were made in the year 1960?

In [16]:
len(titles[titles.year == 1960])

1549

### How many movies were made from 1950 through 1959?

In [17]:
titles[(titles['year']>=1950) & (titles['year']<=1959)].shape[0]

12934

### In what years has a movie titled "Batman" been released?

In [18]:
titles[titles.title == 'Batman']

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [19]:
inception = cast[cast.title == 'Inception']

In [21]:
print('Total no.of roles in inception:',len(inception))
print('Unique roles:', len(inception.character.unique()))

Total no.of roles in inception: 78
Unique roles: 56

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [22]:
print('Total no.of roles in inception that are NOT ranked by an "n" value:',len(inception[inception['n'].isna()]))

Total no.of roles in inception that are NOT ranked by an "n" value: 27

In [23]:
print('Unique roles that are NOT ranked by an "n" value:', len(inception[inception['n'].isna()].character.unique()))

Unique roles that are NOT ranked by an "n" value: 21

### But how many roles in the movie "Inception" did receive an "n" value?

In [24]:
print('Total no.of roles in inception that are ranked by an "n" value:',len(inception[inception['n'].notna()]))

Total no.of roles in inception that are ranked by an "n" value: 51

In [25]:
print('Unique roles that are NOT ranked by an "n" value:', len(inception[inception['n'].notna()].character.unique()))

Unique roles that are NOT ranked by an "n" value: 36

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [26]:
nbn = cast[cast.title=='North by Northwest'].sort_values('n')

In [28]:
nbn[nbn['n'].notna()]

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [32]:
suh = cast[(cast.title=='Sleuth') & (cast.year == 1972)].sort_values('n')

In [33]:
suh[suh['n'].notna()]

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [36]:
suh1 = cast[(cast.title=='Sleuth') & (cast.year == 2007)].sort_values('n')

In [37]:
suh1

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [45]:
len(cast[(cast.title=='Hamlet') & (cast.year==1921)].character)

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [46]:
len(cast[(cast.title=='Hamlet') & (cast.year==1996)].character)

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [47]:
len(cast[cast.character=='Hamlet'])

96

### How many people have played an "Ophelia"?

In [48]:
len(cast[cast.character=='Ophelia'])

117

### How many people have played a role called "The Dude"?

In [51]:
len(cast[cast.character=="Dude"])

99

### How many people have played a role called "The Stranger"?

In [52]:
len(cast[cast.character=="Stranger"])

289

### How many roles has Sidney Poitier played throughout his career?

In [53]:
len(cast[cast.name=='Sidney Poitier'].character)

43

### How many roles has Judi Dench played?

In [54]:
len(cast[cast.name=='Judi Dench'].character)

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [55]:
print("Supporting Roles played by Cary Grant in the 1940s :")

cg = cast[(cast.name=='Cary Grant') & ((cast.year>=1940) & (cast.year<=1950) & (cast.n==2))].sort_values('year')
cg[['year','character']]

Supporting Roles played by Cary Grant in the 1940s :

        year    character
871423  1940   Nick Arden
871433  1941  Roger Adams

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [57]:
cg1 = cast[(cast.name=='Cary Grant') & ((cast.year>=1940) & (cast.year<=1950) & (cast.n==1))].sort_values('year')
cg1[['year','character']]

        year                             character
871448  1940                           Matt Howard
871407  1940                          Walter Burns
871450  1940                    C. K. Dexter Haven
871438  1941                      Johnnie Aysgarth
871452  1942                          Leopold Dilg
871429  1942                 Patrick 'Pat' O'Toole
871398  1943                         Capt. Cassidy
871422  1943  Joe Adams -posing as Joe Bascopolous
871430  1944                           Jerry Flynn
871390  1944                     Mortimer Brewster
871425  1944                            Ernie Mott
871427  1946                                Devlin
871424  1946                           Cole Porter
871444  1947                           Dick Nugent
871445  1947                                Dudley
871421  1948                         Jim Blandings
871402  1948                     Dr. Madison Brown
871411  1949                 Captain Henri Rochard
871396  1950           Dr. Eugene Norland Ferguson

### How many roles were available for actors in the 1950s?

In [58]:
len(cast[(cast.type=='actor') & ((cast.year>=1950) & (cast.year<=1960))].character)

171302

### How many roles were available for actresses in the 1950s?

In [60]:
len(cast[(cast.type=='actress') & ((cast.year>=1950) & (cast.year<=1960))].character)

63333

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [61]:
len(cast[(cast.n==1) & (cast.year<=1980)].character)

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [62]:
len(cast[(cast.n>2) & (cast.year<=1980)].character)

607925

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [63]:
len(cast[(cast['n'].isna()) & (cast.year<=1980)].character)

448347